import pandas

data = [1.645533,
1.662017,
1.656519,
1.662131,
1.651217,
1.661255,
1.656755,
1.651312,
1.656735,
1.656849,
1.656842,
1.656923,
1.662494,
1.646063,
1.656027,
1.651597,
1.657136,
1.657139,
1.657202,
1.656432,
1.657265,
1.657291,
1.657332,
1.662009,
1.657345,
1.651939,
1.657379,
1.651991,
1.652033,
1.657572,
1.657593,
1.657434,
1.652186,
1.657557,
1.653310,
1.663274,
1.668947,
1.662307,
1.657694,
1.663404,
1.663441,
1.659286,
1.663291,
1.657961,
1.652503,
1.657037,
1.657528,
1.652443,
1.663554,
1.658070]
#Данные: измерение массы мелких деталек из одной партии (первая лаб. работа, она как раз была посвящена распределению Гаусса). Удалено одно значение (оно сильно отличается от остальных)
n  = [i+1 for i in range(0,50)]
db = pandas.DataFrame({'Масса' : data})
Shinji = ["000003","Икари","Синдзи","Геннадьевич", 0]
db.to_csv('db.csv')
Student_names_b = ["Александр","Алексей","Андрей","Антон","Артем","Борис","Богдан","Василий","Виктор","Владимир","Владислав","Всеволод","Георгий","Григорий","Геннадий","Дмитрий","Давид","Даниил","Данил","Данила","Егор","Евгений","Иван","Кирилл","Лев","Леонид","Максим","Михаил", "Макар","Никита","Николай","Олег","Петр","Павел","Родион","Роман","Семен","Сергей","Станислав","Тимофей","Федор","Эдуард","Юрий"]
Student_patronymics_b = ["Александрович","Алексеевич","Андреевич","Антонович","Артемович","Борисович","Васильевич","Викторович","Владимирович","Владиславович","Всеволодович","Георгиевич","Григорьевич","Геннадьевич","Дмитриевич","Давидович","Даниилович","Данилович","Данилович","Егорович","Евгеньевич","Иванович","Кириллович","Львович","Леонидович","Максимович","Михайлович", "Макарович","Никитич","Николаевич","Олегович","Петрович","Павлович","Родионович","Романович","Семенович","Сергеевич","Станиславович","Тимофеевич","Федорович","Эдуардович","Юрьевич"]
Student_patronymics_g = ["Александровна","Алексеевна","Андреевна","Антоновна","Артемовна","Борисовна","Васильевна","Викторовна","Владимировна","Владиславовна","Всеволодовна","Георгиевна","Григорьевна","Геннадьевна","Дмитриевна","Давидовна","Данииловна","Даниловна","Даниловна","Егоровна","Евгеньевна","Ивановна","Кирилловна","Львовна","Леонидовна","Максимовна","Михайловна", "Макаровна","Никична","Николаевна","Олеговна","Петровна","Павловна","Родионовна","Романовна","Семеновна","Сергеевна","Станиславовна","Тимофеевна","Федоровна","Эдуардовна","Юрьевна"]
Students_names_g = ["Александра","Анна","Алина","Алиса","Василиса","Валентина","Дарья","Евгения","Елена","Екатерина","Елизавета","Жанна","Зинаида","Инна","Исидора","Кристина","Мария","Милана","Наталья","Наталия","Ольга","Татьяна","Ульяна","Юлия"]
Students_surnames_b = ["Авдеев","Алексеев","Аверкиев","Антонов","Борисов","Васильев","Глухов","Дмитриев","Егоров","Ежов","Енотов","Барсуков","Жилин","Заречный","Игорев","Клюйков","Лазарев","Львов","Лопатин","Максимов","Михайлов","Непоклонов","Денисов","Обухов","Петров","Иванов","Сидоров","Свиридов"]
Students_surnames_g = ["Авдеевa","Алексеевa","Аверкиевa","Антоновa","Борисовa","Васильевa","Глуховa","Дмитриевa","Егоровa","Ежовa","Еотовa","Барсуковa","Жилинa","Заречная","Игорева","Клюйкова","Лазарева","Львова","Лопатина","Максимова","Михайлова","Непоклонова","Денисова","Обухова","Петрова","Иванова","Сидорова","Свиридова"]
                      

stb = pandas.DataFrame({'ss_b':Students_surnames_b,'ss_g':Students_surnames_g,'sn_b':Student_names_b,'sn_g':Students_names_g,'sp_b':Student_patronymics_b, 'sp_g':Student_patronymics_g,  's1':["000003"],'s2':["Икари"],'s3':["Синдзи"],'s4':["Геннадьевич"]})
print (stb)
                    
